app/controllers/meetings_controller.rb

    def create
      @meet.meetings.create!(meeting_params)
---
INSERT INTO "meetings" ("title", "description", "meet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Visit Narnia"], ["description", "false"], ["meet_id", 1], ["created_at", "2020-04-23 16:34:50.204151"], ["updated_at", "2020-04-23 16:34:50.204151"]]

    def update
      @meeting.update(meeting_params)
---
UPDATE "meetings" SET "title" = ?, "updated_at" = ? WHERE "meetings"."id" = ?  [["title", "Mozart"], ["updated_at", "2020-04-23 16:34:50.385758"], ["id", 1]]

    def destroy
      @meeting.destroy
---
DELETE FROM "meetings" WHERE "meetings"."id" = ?  [["id", 1]]

    def set_meet
      @meet = Meet.find(params[:meet_id])
---
SELECT "meets".* FROM "meets" WHERE "meets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_meet_meeting
      @meeting = @meet.meetings.find_by!(id: params[:id]) if @meet
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."meet_id" = ? AND "meetings"."id" = ? LIMIT ?  [["meet_id", 1], ["id", 1], ["LIMIT", 1]]