app/controllers/meets_controller.rb

SELECT "meets".* FROM "meets"
---
  def index
    @meets = Meet.all

INSERT INTO "meets" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Learn Elm"], ["description", "This is a meeting for people learning Elm"], ["created_at", "2020-04-23 16:11:19.274890"], ["updated_at", "2020-04-23 16:11:19.274890"]]
---
  def create
    @meet = current_user.meets.create!(meet_params)

UPDATE "meets" SET "title" = ?, "updated_at" = ? WHERE "meets"."id" = ?  [["title", "Shopping"], ["updated_at", "2020-04-23 16:11:19.397154"], ["id", 1]]
---
  def update
    @meet.update(meet_params)

DELETE FROM "meets" WHERE "meets"."id" = ?  [["id", 1]]
---
  def destroy
    @meet.destroy

SELECT "meets".* FROM "meets" WHERE "meets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_meet
    @meet = Meet.find(params[:id])