api/app/controllers/authentication_controller.rb

  def authenticate
    auth_token =
    AuthenticateUser.new(auth_params[:email], auth_params[:password]).call

    user = User.find_by(email: auth_params[:email]) if auth_token
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sarah@mail.com"], ["LIMIT", 1]]