api/app/controllers/meetings_controller.rb

SELECT "meets".* FROM "meets" WHERE "meets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_meet
    @meet = Meet.find(params[:meet_id])

SELECT "meetings".* FROM "meetings" WHERE "meetings"."meet_id" = ? AND "meetings"."id" = ? LIMIT ?  [["meet_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_meet_meeting
    @meeting = @meet.meetings.find_by!(id: params[:id]) if @meet