api/app/controllers/meets_controller.rb

  def index
    @meets = Meet.all
---
SELECT "meets".* FROM "meets"

  def set_meet
    @meet = Meet.find(params[:id])
---
SELECT "meets".* FROM "meets" WHERE "meets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]