api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sarah01@mail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
        user = User.new(email: params[:email], password: params[:password], password_confirmation: params[:password_confirmation], name: params[:name])

        user.picture = 'https://joeschmoe.io/api/v1/random' if !user.picture || user.picture.empty?

        user.save